Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/studying_in_ireland/third_level_education.html.txt.tmx
Source language: en
Languages: ga

source: Moving to Ireland for third-level education
ga: Teacht go hÉirinn le freastal ar oideachas tríú leibhéil

source: If you are moving to Ireland in order to study or if you wish to enrol a child into a third-level college, you will need to explore the full range of options available to you
ga: Má tá tú ag teacht go hÉirinn le dul ag staidéar nó más mian leat do pháiste a chlárú mar mhac léinn tríú leibhéil ní mór duit breathnú ar na roghanna atá ar fáil duit

source: The third-level education sector in Ireland consists of universities, institutes of technology, and colleges of education - collectively known as higher education institutions or HEIs
ga: Ollscoileanna, institiúidí teicneolaíochta agus coláistí oiliúna oidí scoile iad na hinstitiúidí a chuireann oideachas tríú leibhéil ar fáil in Éirinn - ar a dtugtar institiúidí ardoideachais i dteannta a chéile

source: Third-level qualifications are Levels 6-10 in the National Framework of Qualifications (NFQ). The Framework is a system of 10 levels which allows national and international educational qualifications to be compared
ga: Leibhéil 6-10 is ea na cáilíochtaí Tríú Leibhéal i gCreatoibre Náisiúnta na gCáilíochtaí (CNC) Is córas de 10 leibhéal é an Creatoibre a ligeann do chomparáid idir cáilíochtaí oideachais náisiúnta agus idirnáisiúnta

source: Quality and Qualifications Ireland (QQI) has taken over the functions of the following 4 bodies: National Qualifications Authority of Ireland (NQAI), Further Education and Training Awards Council (FETAC), Higher Education and Training Awards Council (HETAC) and Irish Universities Quality Board (IUQB)
ga: Thóg Dearbhú Cáilíochta agus Cáilíochtaí Éireann (DCCI) láimh na feidhmeanna na 4 chomhlacht seo leanas: Údarás Náisiúnta um Cháilíochtaí na hÉireann (ÚNCÉ), Comhairle na nDámhachtainí Breisoideachais agus Oiliúna (CDBO), Comhairle na Dámhachtainí Ardoideachais agus Oiliúna (CDAO) agus Bord um Cháilíochtaí Ollscoileanna na hÉireann (BCOÉ)

source: Education providers can apply to QQI for an International Education Mark based on their compliance with the Code of Practice for the Providers of Programmes of Education and Training to International Learners (pdf)
ga: Is féidir le soláthraithe oideachais iarratas ar DCCI a dhéanamh ar Mharc Oideachais Idirnáisiúnta atá bunaithe ar chomhlíonadh Cód Cleachtais le haghaidh Soláthróirí Cláir Oideachais agus Oiliúna do Mhic léinn Ídirnáisiúnta (pdf)

source: Universities in Ireland are State-funded, but they are generally autonomous
ga: Tá ollscoileanna na hÉireann maoinithe ag an Stát ach tá siad neamhspléach, go hiondúil

source: University students qualify with Ordinary Bachelors degrees (NFQ Level 7) or Honors Bachelors degrees (NFQ Level 8)
ga: Baineann mic léinn ollscoile cáilíocht amach le Gnáthchéim Bhaitsiléara (Leibhéal 7) nó Céimeanna Onóracha Baitsiléara (Leibhéal 8)

source: You can choose from 4 universities that include:
ga: Is féidir do rogha ceann de 4 ollscoil a phiocadh in Éirinn

source: • The National University of Ireland (NUI), which is the umbrella university covering University College Dublin, NUI Galway, University College Cork, and St
ga: • Ollscoil Náisiúnta na hÉireann, (ONÉ), a bhfuil na hollscoileanna seo a leanas faoina scáth Coláiste na hOllcoile BÁC, OÉ Gaillimh, Coláiste na hOllscoile, Corcaigh agus Coláiste Phádraig, Maigh Nuadh

source: Patrick's College in Maynooth
ga: Tá choláiste aitheanta freisin ag ONÉ

source: The NUI also has recognised colleges including the National College of Art and Design and the Royal College of Surgeons
ga: Is iad sin Coláiste Náisiúnta na nEalaín agus Dearthaagus Coláiste Ríoga na Máinlianna

source: • The University of Dublin, which is generally known as Trinity College Dublin
ga: • Ollscoil Bhaile Átha Cliath, ar a dtugtar go hiondúil Coláiste na Tríonóide, Baile Átha Cliath

source: There are 14 institutes of technology located around the country
ga: Tá 14 institiúidí teicneolaíochta ar fud na tíre

source: Around the country they are in Cork, Waterford, Tralee, Dundalk, Athlone, Galway and Mayo, Sligo, Letterkenny, Limerick, and Carlow. These colleges run courses in Engineering, Computing, Science, Business, Catering and a wide range of other areas
ga: Is coláistí iad seo atá lonnaithe i mBaile Átha Cliath, i mBaile Bhlainséir, i dTamhlacht, i nDhún Laoghaire, i gCorcaigh, i bPort Láirge, i dTrá Lí , i nDún Dealgán, i mBaile Átha Luain , i nGaillimh agus Mhaigheo, i Sligeach , i Leitir Ceanainn, i Luimneach agus i gCeatharlach Cúrsaí Innealtóireachta, Ríomhaireachta, Eolaíochta, Gnó, Lónadóireachta agus réimse ábhar eile nach iad a chuireann na coláistí seo ar fáil

source: Students generally qualify with Higher Certificates (NFQ Level 6) or Ordinary Bachelors degrees (NFQ Level 7)
ga: Baineann mic léinn cáilíocht amach go hiondúil le hArdteastais (Leibhéal 6) nó le Gnáthchéimeanna Baitsiléara (Leibhéal 7)

source: Honours Bachelors degrees (NFQ Level 8) are also available
ga: Tá céimeanna Onóracha Baitsiléara (Leibhéal 8) ar fáil fosta

source: There are several colleges of education providing specialised training for primary school teachers
ga: Tá coláistí oiliúna éagsúla d'oidí in Éirinn a chuireann traenáil faoi leith ar fáil do mhúinteoirí bunscoile

source: In addition to the State-funded colleges, there are a number of fee-paying third-level educational institutions offering courses, mainly in professional vocational training and business
ga: Chomh maith leis na coláistí atá maoinithe ag an Stát tá roinnt institiúidí oideachais tríú leibhéil a ghearann táillí a chuireann cúrsaí ar fáil, go mór mór traenáil ghairmiúil phroifisiúnta agus gnó

source: Some of these colleges are linked to universities or professional associations and their qualifications may be accredited accordingly
ga: Tá cuid de na coláistí seo nascaithe le hollscoileanna nó le cumainn phroifisiúnta agus aitheantas dá réir ag na cailíochtaí a bhaintear amach iontu

source: Others offer Quality and Qualifications Ireland accreditation
ga: Cuireann cuid eile acu creidiúnú Dearbhú Cáilíochta agus Cáilíochtaí Éireann ar fáil

source: It is important to check out the accreditation on offer before you choose your course
ga: Tá sé tábhachtach fáil amach cén t-aitheantas atá ag cúrsa roimh a roghnaíonn tú é

source: The Central Applications Office (CAO), which is based in Galway, operates a centralised applications procedure for all third-level colleges
ga: Oibríonn an Lár-Oifig Iontrála (CAO), atá lonnaithe i nGaillimh, nós imeachta lárnaithe iarratas le haghaidh gach coláiste tríú leibhéal

source: The CAO website has a listing of all of the third-level courses on offer through their system
ga: Ar láithreán Gréasáin an CAO tá de gach cúrsa tríú leibhéal atá ar fáil trína chóras

source: You can also check the Qualifax website for lists of higher education courses. If you have identified some courses that are of particular interest, you can obtain more detailed information about them from the relevant colleges
ga: Is féidir leat láithreán Gréasáin Qualifax le haghaidh liosta de chúrsaí ardoideachais a sheiceáil chomh maith Má tá cúrsaí faoi leith sainithe agat a bhfuil suim faoi leith agat iontu, is féidir leat eolas níos mionsonraithe a fháil fúthu ó na coláistí cuí

source: Entrance to third-level education in Ireland is generally decided by competition
ga: Déantar cinneadh faoi áiteanna a dháileadh i gcoláistí tríú leibhéil na tíre seo tríd comórtas

source: At the end of their secondary school education, students sit the Leaving Certificate exam and their grades are converted into numerical points based on scores in their 6 best subjects
ga: Ag deireadh na meánscoile déanann na mic léinn scrúdú don Ardteistiméireacht agus áirítear a gcuid grádanna i bhfigiúir bunaithe ar an sé ghrád is fearr a fhaigheann siad

source: These points are calculated and third-level places are awarded on that basis
ga: Is ar bhunús na bpointí seo a chuirtear áiteanna tríú leibhéil ar fáil do mhic léinn

source: You can find more information in our document on applications procedures and entry requirements
ga: Tá tuilleadh eolais ar fáil sa mhír córas iontrála agus riachtanais iontrála

source: Recognition of qualifications from other countries
ga: Aitheantas ar chailíochtaí a baineadh amach thar lear

source: If you have taken your secondary school exams under another system in another country, you will need to check whether your qualifications will be sufficient to secure a place in the Irish third-level course of your choice
ga: Má dhein tú scrúduithe dara leibhéil faoi chóras eile i dtír eile beidh ort fáil amach an bhfuil na cailíochtaí atá agat in ann áit ar do rogha cúrsa tríú leibhéil in Éirinn a bhaint amach duit

source: You can do this through the Qualifications Recognition Service
ga: Tá tuilleadh eolais sa tSeirbhís Aitheantas Cáilíochtaí

source: You should then contact the college directly to confirm this before making your application
ga: Déan teagmháil leis an gcoláiste féin len é seo a chinntiú roimh d'iarratas a dhéanamh

source: English is the language of instruction at all third-level colleges in Ireland (some colleges also instruct in the Irish language) so you will need to show that you are proficient in the language before you will be accepted on a course
ga: Is tré mheán an Bhéarla a dhéantar na cúrsaí a theagasc i gcoláistí tríú leibhéil na hÉireann (bíonn cuid de na coláistí ag teagasc trí mheán na Gaeilge freisin) agus beidh ort a thaispeáint go bhfuil tú líofa sa teanga roimh áit a fháil ar an gcúrsa

source: Colleges’ requirements differ but generally they look for an acceptable English language proficiency test, for example the TOEFL or equivalent
ga: Bíonn difear ann idir riachtanais coláistí ach go hiondúil bíonn tástáil ar chumas sa Bhéarla de dhíth, mar shampla an TOEFL

source: You may be able to take English courses at the college of your choice, but if these are not available there are a number of private English language colleges around the country
ga: D'fhéadfadh ranganna Béarla a bheith ar fáil ag do rogha coláiste, ach muna bhfuil tá cuid mhaith coláistí Béarla príobháideacha ar fud na tíre

source: A small number of places are retained for mature students, those over the age of 23
ga: Cuirtear líon beag áiteanna ar leathaobh ar mhaithe le mic léinn aibí, daoine atá ós cionn 23

source: These places are designed to improve access to third-level for adults who may not have sufficient points from their Leaving Certificate to compete with school-leavers
ga: Tá na háiteanna seo ar fáil go speisialta do dhaoine fásta nach bhfuair a ndóthain pointí b'fhéidir ina scrúduithe Ardteistiméireachta le dul i gcomórtas leo siúd atá ag fágáil na scoile

source: If you are interested in applying for one of these places, you should first contact the college of your choice
ga: Más spéis leat iarratas a dhéanamh ar áit mar seo ní mór duit iarratas a dhéanamh díreach chuig do rogha coláiste

source: Some colleges require you to apply through the Central Applications Office and you must apply before 1 February of the year you start your course
ga: Éilíonn coláistí áirithe ort iarratas a dhéanamh tríd an gcóras LOI agus caithfidh tú iarratas a sheoladh roimh 1 Feabhra sa bhliain a dtosaínn tú do chúrsa

source: There are a number of part-time and modular courses and distance education options available if the full-time education option does not suit your circumstances
ga: Tá roinnt cúrsaí páirt-aimseartha agus modúlacha chomh maith le cúrsaí cianoideachais ar fáil muna bhfuil cúrsaí lán-aimseartha feiliúnach duit

source: Student visas and permission to remain
ga: Víosaí mic léinn agus cead fanachta

source: Non-EEA nationals coming to study in Ireland must be enrolled in an eligible full-time course listed on the Interim List of Eligible Programmes (ILEP) for student immigration purposes
ga: Má thagann náisiúnaigh neamh-LEE le staidéar in Éirinn ní mór dóibh clárú le haghaidh cúrsa lánaimseartha incháilithe liostaithe ar an Liosta Eatramhach de Chláir Incháilithe (ILEP) maidir le himirce mhic léinn

source: You can find out more in our document on the immigration rules for non-EEA students
ga: Is féidir leat tuilleadh faisnéise a fháil inár ndoiciméad le haghaidh na rialacha inimirce do mhic léinn neamh-LEE

source: If you are travelling from a country that requires a visa to enter Ireland, you need to apply for a student visa
ga: Má bhíonn tú ag taisteal ó thír a dteastaíonn víosa uaithi le dul isteach go hÉirinn, ní mór duit iarratas a chur isteach ar víosa mic léinn

source: If you are not required to have a visa to enter Ireland, you do not need a student visa to study in Ireland but you should have your letter of offer of a place at the school, or educational institution and your other documentation ready for inspection at immigration
ga: Mura dteastaíonn víosa uait le dul isteach go hÉirinn, ní gá duit víosa mic léinn a bheith agat le staidéar a dhéanamh in Éirinn ach ba chóir go mbeadh litir agat ag tairiscint áit sa scoil, nó san institiúid oideachais agus do cháipéisí eile réidh le haghaidh iniúchta ag inimirce

source: All non-EEA students must register with their local immigration officer to get permission to remain in Ireland. The website of the Irish Naturalisation and Immigration Service (INIS) has details of what evidence is required
ga: Ní mó do gach mac léinn nach náisiúnaithe de chuid an LEE iad clárú lena n-oifigeach áitiúil um inimirce chun cead a fháil fanacht in Éirinn Tá sonraí ar láithreán gréasáin Sheirbhís Eadóirseachta agus Inimirce na hÉireann (SEIE) faoin bhfianaise atá ag teastáil

source: Non-EEA students coming to Ireland for the first time may not get permission to remain in Ireland if they have their children with them, or intend their children to join them later on
ga: Is féidir nach bhfaighidh mic léinn nach de chuid an LEE iad agus atá ag teacht go hÉirinn den chéad uair cead fanachta in Éirinn má bhíonn a gcuid páistí leo, nó má bhíonn sé beartaithe a gcuid páistí a thabhairt anonn níos moille

source: There is more information about the children of non-EEA students on the INIS website (pdf)
ga: Tá tuilleadh sonraí ar fáil maidir le páistí mac léinn nach de chuid an LEE iad ar láithreán gréasáin INIS (pdf)

source: Students from the EU/EEA and Switzerland do not need a student visa nor do they require permission to remain in Ireland
ga: Níl víosa mic léinn ag teastáil ó mhic léinn ón AE/LEE agus ón Eilvéis ná níl cead ag teastáil uathu chun fanacht in Éirinn

source: Third level graduate scheme
ga: Scéim do Chéimithe Tríú Leibhéal

source: Non-EEA students who have graduated with a Level 7 degree may be permitted to remain in Ireland for 6 months
ga: D'fhéadfaí cead a thabhairt fanacht in Éirinn ar feadh 6 mhí, do mhic léinn neamh-LEE a bhain céim amach an 1 Eanáir 2007 nó ina dhiaidh sin, le céim leibhéal 7

source: Those with a degree at level 8, 9 or 10 may be allowed to remain for 12 months
ga: Má tá céim leibhéal 8, 9 nó 10 acu, d'fhéadfaí cead a thabhairt fanacht dóibh ar feadh 12 mhí

source: The Third Level Graduate Scheme (pdf) allows them to find employment and apply for a General Employment Permit or Critical Skills Employment Permit
ga: Ligeann an Scéim do Chéimithe Tríú Leibhéal (pdf) dóibh fostaíocht a fháil agus cur isteach ar chead fostaíochta ginearálta nó chead fostaíochta scileanna criticiúla

source: They must be legally resident in Ireland
ga: Ní mór dóibh a bheith lonnaithe go dlíthiúil in Éirinn

source: Under the scheme, they should apply to their local immigration registration office and, if they are granted permission to remain, from 1 February 2016 they will get stamp 1G
ga: Faoin scéim, ba chóir dóibh cur isteach chuig a n-oifig áitiúil um inimirce agus, má thabharfar dóibh cead fanachta, ó 1 Feabhra 2016 gheobhaidh siad stamp 1G

source: Each higher education institution sets its own tuition fee rates
ga: Socraíonn gach institiúid bhreisoideachais a gcuid rátaí féin táillí

source: In general they also charge a separate student contribution
ga: Go ginearálta, gearrann siad ranníocaíocht mac léinn ar leith freisin

source: You should contact the ones you are interested in to find out what they require
ga: Ba chóir duit teagmháil a dhéanamh leis na cinn a bhfuil suim agat iontu chun tuilleadh eolais a fháil faoina dtáillí

source: You can find a list of higher education institutions on the website of the Department of Education and Skills
ga: Is féidir teacht ar liosta na n-institiúidí breisoideachais ar láithreán gréasáin na Roinne Oideachais agus Scileanna

source: Free fees: If you are an EEA or Swiss national and you have been normally resident in the EEA or Switzerland for at least 3 of the 5 years before beginning third-level education, you will not be charged fees for approved full-time undergraduate courses in State-funded universities and institutes of technology
ga: Táillí saor in aisce Más náisiúnach de chuid an LEE nó Eilvéiseach thú agus tú lonnaithe go hiondúil i mballstát an LEE nó san Eilvéis le haghaidh 3 de na 5 bliana sular thosaigh tú ar an oideachas tríú leibhéal, ní ghearrfar táillí ort le haghaidh cúrsaí lánaimseartha fochéime in ollscoileanna atá eagraithe ag an stát ná in institiúidí teicneolaíochta

source: Other people such as those with refugee status may also be eligible for free fees
ga: Is féidir go mbeidh daoine eile, mar shampla, má tá stádas oifigiúil dídeanaithe acu, i dteideal táillí saor in aisce freisin

source: You may be eligible for a maintenance grant
ga: Is féidir go mbeidh tú i dteideal deontas cothaithe

source: Funding is not awarded where students already hold an undergraduate degree or are repeating a year
ga: Ní thugtar maoiniú nuair a bhíonn fochéim ag mic léinn cheana féin nó nuair a athdhéanann siad bliain

source: EU fees: If you are an EEA or Swiss national who is not eligible for free fees or if you have been tax resident in the EEA or Switzerland for a number of years you may be eligible to pay fees at EU rates
ga: Táillí an AE Más saoránach de chuid an LEE nó Eilvéiseach thú mura bhfuil i dteideal táillí saor in aisce nó má tá cónaí ort i stát an AE le haghaidh roinnt bliana is féidir go mbeidh tú i dteideal táillí rátaí an AE a íoc

source: Non-EU fees: If you are applying for a place at third level as an overseas student and you are not eligible for free fees or EU fee rates, you will be charged full tuition fees and you will not be eligible for a maintenance grant
ga: Táillí neamh-AE: Má tá tú ag déanamh iarratais ar chúrsa tríú leibhéil mar mhac léinn eachtrach agus mura mbíonn tú i dteideal táillí saor in aisce nó táillí rátaí an AE, gearrfar táillí iomlán ort agus ní bheidh tú i dteideal deontais ar son do chothaithe

source: If you choose to enrol in a private college, you will have to pay fees
ga: Má roghnaíonn tú clárú le coláiste príobháideach beidh táille bhliantúil le híoc agat

source: These vary from college to college
ga: Braitheann na táillí ar an gcoláiste atá i gceist

source: You can find more detailed information in our document on third-level student fees and charges
ga: Tá tuilleadh eolais sonraithe inár ndoiciméad maidir le táillí agus muirir do mhic léinn tríú leibhéal

source: Tax relief: You may be able to claim tax relief on third-level tuition fees
ga: Faoiseamh cánach: D'fhéadfadh sé go mbeadh tú i dteideal faoiseamh cánach ag an ngnáthráta ar fáil ar son táillí íoctha le coláistí triúleibhéil

source: Apply to the Central Applications Office (CAO) using a CAO application form
ga: Cuir iarratas chuig an LárOifig Iontrála ar fhoirm iarratais an LOI

source: Make sure that you enclose the appropriate fee with your application
ga: Bí cinnte an táille iarratais chuí a chur leis an iarratas

source: For participating higher education institutions, application can be made on-line through the CAO
ga: Is féidir iarratas a dhéanamh chuig na hinstitiúidí ardoideachais ar an suíomh idirlín atá ag an LOI

source: Application deadlines for EU/EEA nationals
ga: Dátaí deireanacha le glacadh le hiarratais ón AE

source: Your application should be submitted by 1 February of the year you wish to start the course
ga: Ní mór an t-iarratas a dhéanamh ar a dheireanas ar an 1 Feabhra más den AE thú

source: If you miss the February deadline, you can submit your application up to 1 May
ga: Má theipeann ort an t-iarratas a dhéanamh roimh an dáta sin is féidir iarratas deireanach a dhéanamh suas go dtí an 1 Bealtaine

source: You will have to pay an additional "late fee"
ga: Beidh táille bhreise ar iarratas deireanach le n-íoc

source: Application deadlines for non-EEA nationals
ga: Dátaí deireanacha le glacadh le hiarratais ó thaobh amuigh den AE/LEE

source: If you are now, or have been in the past, resident outside the EEA, you may be required to apply directly to the higher education institution (HEI)
ga: Má tá tú anois, nó má bhí tú roimhe seo, i do chónaí taobh amuigh den LEE, is féidir go mbeidh ort iarratas díreach a dhéanamh chuig an institiúid ardoideachais (IA)

source: You need to contact the admissions office of the HEI to enquire whether you should apply through the CAO or directly to the HEI
ga: Ní mór duit teagmháil a dhéanamh le hoifig iontrálacha na n-institiúidí ardoideachais chun fiosrú a dhéanamh cé acu ar chóir duit iarratas a chur isteach tríd an CAO nó go díreach chuig an IA

source: You should make your enquiries well before the closing date of 1 February and preferably not later than the previous 15 December
ga: Ba chóir duit do chuid fiosrúchán a dhéanamh roimh an spriocdháta an 1 Feabhra agus b’fhearr é seo a dhéanamh ar dháta nach moille ná an 15 Nollaig roimhe

source: If you are applying to any other HEI you should apply through the CAO
ga: Má tá tú ag cur isteach ar Institiúid Ardoideachais eile ba chóir duit iarratas a dhéanamh tríd an CAO
